#include <stdio.h>

int main() {
    
    int x;
    
    
    printf("x тоог оруулна уу: ");
    scanf("%d", &x);
    printf("x тоо бол: %d\n", x);
    
    
    0 <= x && x < 10 && printf("Ороны тоо: 2\n");
    10 <= x && x < 100 && printf("Ороны тоо: 2\n");
    100 <= x && x < 1000 && printf("Ороны тоо: 3\n");
    1000 <= x && x < 10000 && printf("Ороны тоо: 4\n");
    10000 <= x && x < 100000 && printf("Ороны тоо: 5\n");
    100000 <= x && x < 1000000 && printf("Ороны тоо: 6\n");
    1000000 <= x && x < 10000000 && printf("Ороны тоо: 7\n");
    10000000 <= x && x < 100000000 && printf("Ороны тоо: 8\n");
    100000000 <= x && x < 1000000000 && printf("Ороны тоо: 9\n");
    1000000000 <= x && x < 10000000000 && printf("Ороны тоо: 10\n");
    

    // 2^31 hurtel baidag tul 10 hurtel orontoi baina.
    
}

